
## Plan Result (aat)




<pre><code>Plan: 10 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * module.elastic2[0].azurerm_network_security_rule.aks_rule
  * module.elastic2[0].azurerm_network_security_rule.apps_rule
  * module.elastic2[0].azurerm_network_security_rule.bastion_es_rule[0]
  * module.elastic2[0].azurerm_network_security_rule.bastion_ssh_rule
  * module.elastic2[0].azurerm_network_security_rule.denyall_kibana_rule[0]
  * module.elastic2[0].azurerm_network_security_rule.jenkins_rule
  * module.elastic2[0].azurerm_network_security_rule.kibana_tight_kibana_rule[0]
  * module.elastic2[0].azurerm_network_security_rule.kibana_tight_ssh_rule[0]
  * module.elastic2[0].azurerm_resource_group.elastic-resourcegroup
  * module.elastic2[0].azurerm_template_deployment.elastic-iaas
* Update
  * module.elastic.azurerm_network_security_rule.aks_rule
  * module.elastic.azurerm_network_security_rule.apps_rule
  * module.elastic.azurerm_network_security_rule.bastion_es_rule[0]
  * module.elastic.azurerm_network_security_rule.jenkins_rule
  * module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0]
  * module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0]
  * module.elastic.azurerm_resource_group.elastic-resourcegroup
  * module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group
  * module.elastic2[0].module.elastic_action_group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.elastic.data.azurerm_application_security_group.data_asg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "data_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-data-asg"
      + resource_group_name = "ccd-elastic-search-aat"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_application_security_group.kibana_asg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "kibana_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-asg"
      + resource_group_name = "ccd-elastic-search-aat"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "cluster_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-cluster-nsg"
      + resource_group_name = "ccd-elastic-search-aat"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.kibana_nsg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "kibana_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-nsg"
      + resource_group_name = "ccd-elastic-search-aat"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.azurerm_network_security_rule.aks_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "aks_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.apps_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "apps_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.bastion_es_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "bastion_es_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Bastion_To_ES"
        name                                       = "Bastion_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.jenkins_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "jenkins_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_kibana_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_Kibana"
        name                                       = "Bastion_only_Kibana"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_ssh_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_SSH"
        name                                       = "Bastion_only_SSH"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_resource_group.elastic-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "elastic-resourcegroup" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat"
        name       = "ccd-elastic-search-aat"
      ~ tags       = {
          - "application"         = "core-case-data"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ccd-community"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-05-17T14:18:38Z"
          - "managedBy"           = "CCD"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.elastic2[0].data.azurerm_application_security_group.data_asg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "data_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "17635data-asg"
      + resource_group_name = "ccd-17635-elastic-search-aat"
      + tags                = (known after apply)
    }

  # module.elastic2[0].data.azurerm_application_security_group.kibana_asg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "kibana_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "17635kibana-asg"
      + resource_group_name = "ccd-17635-elastic-search-aat"
      + tags                = (known after apply)
    }

  # module.elastic2[0].data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "cluster_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "17635cluster-nsg"
      + resource_group_name = "ccd-17635-elastic-search-aat"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic2[0].data.azurerm_network_security_group.kibana_nsg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "kibana_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "17635kibana-nsg"
      + resource_group_name = "ccd-17635-elastic-search-aat"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic2[0].azurerm_network_security_rule.aks_rule will be created
  + resource "azurerm_network_security_rule" "aks_rule" {
      + access                                     = "Allow"
      + description                                = "Allow AKS to access the ElasticSearch cluster"
      + destination_application_security_group_ids = (known after apply)
      + destination_port_range                     = "9200"
      + direction                                  = "Inbound"
      + id                                         = (known after apply)
      + name                                       = "AKS_To_ES"
      + network_security_group_name                = "17635cluster-nsg"
      + priority                                   = 215
      + protocol                                   = "Tcp"
      + resource_group_name                        = "ccd-17635-elastic-search-aat"
      + source_address_prefixes                    = [
          + "10.10.128.0/20",
          + "10.10.144.0/20",
        ]
      + source_port_range                          = "*"
    }

  # module.elastic2[0].azurerm_network_security_rule.apps_rule will be created
  + resource "azurerm_network_security_rule" "apps_rule" {
      + access                                     = "Allow"
      + description                                = "Allow Apps to access the ElasticSearch cluster"
      + destination_application_security_group_ids = (known after apply)
      + destination_port_range                     = "9200"
      + direction                                  = "Inbound"
      + id                                         = (known after apply)
      + name                                       = "App_To_ES"
      + network_security_group_name                = "17635cluster-nsg"
      + priority                                   = 210
      + protocol                                   = "Tcp"
      + resource_group_name                        = "ccd-17635-elastic-search-aat"
      + source_address_prefixes                    = [
          + "10.96.140.0/22",
        ]
      + source_port_range                          = "*"
    }

  # module.elastic2[0].azurerm_network_security_rule.bastion_es_rule[0] will be created
  + resource "azurerm_network_security_rule" "bastion_es_rule" {
      + access                                     = "Allow"
      + description                                = "Allow Bastion access for debugging elastic queries on development platforms"
      + destination_application_security_group_ids = (known after apply)
      + destination_port_range                     = "9200"
      + direction                                  = "Inbound"
      + id                                         = (known after apply)
      + name                                       = "Bastion_To_ES"
      + network_security_group_name                = "17635cluster-nsg"
      + priority                                   = 200
      + protocol                                   = "Tcp"
      + resource_group_name                        = "ccd-17635-elastic-search-aat"
      + source_address_prefixes                    = [
          + "10.11.72.32/27",
        ]
      + source_port_range                          = "*"
    }

  # module.elastic2[0].azurerm_network_security_rule.bastion_ssh_rule will be created
  + resource "azurerm_network_security_rule" "bastion_ssh_rule" {
      + access                      = "Allow"
      + description                 = "Allow Bastion SSH access overridding templates broad SSH access"
      + destination_address_prefix  = "10.96.149.0/24"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Bastion_To_VMs"
      + network_security_group_name = "17635cluster-nsg"
      + priority                    = 230
      + protocol                    = "Tcp"
      + resource_group_name         = "ccd-17635-elastic-search-aat"
      + source_address_prefixes     = [
          + "10.11.72.32/27",
        ]
      + source_port_range           = "*"
    }

  # module.elastic2[0].azurerm_network_security_rule.denyall_kibana_rule[0] will be created
  + resource "azurerm_network_security_rule" "denyall_kibana_rule" {
      + access                      = "Deny"
      + description                 = "Deny all traffic that is not SSH or Kibana access"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllOtherTraffic"
      + network_security_group_name = "17635kibana-nsg"
      + priority                    = 400
      + protocol                    = "*"
      + resource_group_name         = "ccd-17635-elastic-search-aat"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.elastic2[0].azurerm_network_security_rule.jenkins_rule will be created
  + resource "azurerm_network_security_rule" "jenkins_rule" {
      + access                                     = "Allow"
      + description                                = "Allow Jenkins to access the ElasticSearch cluster for testing"
      + destination_application_security_group_ids = (known after apply)
      + destination_port_range                     = "9200"
      + direction                                  = "Inbound"
      + id                                         = (known after apply)
      + name                                       = "Jenkins_To_ES"
      + network_security_group_name                = "17635cluster-nsg"
      + priority                                   = 220
      + protocol                                   = "Tcp"
      + resource_group_name                        = "ccd-17635-elastic-search-aat"
      + source_address_prefix                      = "10.10.76.0/23"
      + source_port_range                          = "*"
    }

  # module.elastic2[0].azurerm_network_security_rule.kibana_tight_kibana_rule[0] will be created
  + resource "azurerm_network_security_rule" "kibana_tight_kibana_rule" {
      + access                                     = "Allow"
      + description                                = "Override open Kibana accessand limit this to Bastion only"
      + destination_application_security_group_ids = (known after apply)
      + destination_port_range                     = "5601"
      + direction                                  = "Inbound"
      + id                                         = (known after apply)
      + name                                       = "Bastion_only_Kibana"
      + network_security_group_name                = "17635kibana-nsg"
      + priority                                   = 310
      + protocol                                   = "Tcp"
      + resource_group_name                        = "ccd-17635-elastic-search-aat"
      + source_address_prefixes                    = (sensitive value)
      + source_port_range                          = "*"
    }

  # module.elastic2[0].azurerm_network_security_rule.kibana_tight_ssh_rule[0] will be created
  + resource "azurerm_network_security_rule" "kibana_tight_ssh_rule" {
      + access                                     = "Allow"
      + description                                = "Override open SSH and limit this to Bastion only"
      + destination_application_security_group_ids = (known after apply)
      + destination_port_range                     = "22"
      + direction                                  = "Inbound"
      + id                                         = (known after apply)
      + name                                       = "Bastion_only_SSH"
      + network_security_group_name                = "17635kibana-nsg"
      + priority                                   = 300
      + protocol                                   = "Tcp"
      + resource_group_name                        = "ccd-17635-elastic-search-aat"
      + source_address_prefixes                    = (sensitive value)
      + source_port_range                          = "*"
    }

  # module.elastic2[0].azurerm_resource_group.elastic-resourcegroup will be created
  + resource "azurerm_resource_group" "elastic-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ccd-17635-elastic-search-aat"
      + tags     = (known after apply)
    }

  # module.elastic2[0].azurerm_template_deployment.elastic-iaas will be created
  + resource "azurerm_template_deployment" "elastic-iaas" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "ccd-17635-elastic-search-aat"
      + outputs             = (known after apply)
      + parameters          = {
          + "_artifactsLocation"               = "https://raw.githubusercontent.com/hmcts/azure-marketplace/7.11.1_hmcts/src/"
          + "adminUsername"                    = "elkadmin"
          + "authenticationType"               = "sshPublicKey"
          + "dataNodesAreMasterEligible"       = "Yes"
          + "esAdditionalYaml"                 = <<-EOT
                action.auto_create_index: .security*,.monitoring*,.kibana*,.watches,.triggered_watches,.watcher-history*,.logstash_dead_letter,.ml*
                xpack.monitoring.collection.enabled: true
                script.allowed_types: inline
                script.allowed_contexts: template, ingest
                ingest.geoip.downloader.enabled: false
            EOT
          + "esClusterName"                    = "ccd-17635-elastic-search-aat"
          + "esVersion"                        = "7.17.0"
          + "kibana"                           = "Yes"
          + "kibanaAdditionalYaml"             = <<-EOT
                console.enabled: false
            EOT
          + "location"                         = "uksouth"
          + "logAnalyticsId"                   = "83e233a4-64bc-48c2-9b8c-21dd43b327e8"
          + "logAnalyticsKey"                  = (sensitive value)
          + "logstash"                         = "No"
          + "securityAdminPassword"            = "vWJ3pdAEaJIm6rAX"
          + "securityApmPassword"              = "vWJ3pdAEaJIm6rAX"
          + "securityBeatsPassword"            = "vWJ3pdAEaJIm6rAX"
          + 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

              }
                      + Standard_L16s_v2  = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_L32s     = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_L32s_v2  = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_L48s_v2  = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_L4s      = {
                          + dataDisks          = 16
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_L64s_v2  = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_L80s_v2  = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_L8s      = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_L8s_v2   = {
                          + dataDisks          = 16
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M128     = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M128m    = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M128ms   = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M128s    = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M16ms    = {
                          + dataDisks          = 16
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M32ls    = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M32ms    = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M32ts    = {
                          + dataDisks          = 32
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M64      = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M64ls    = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M64m     = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M64ms    = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M64s     = {
                          + dataDisks          = 64
                          + storageAccountType = "Premium_LRS"
                        }
                      + Standard_M8ms     = {
                          + dataDisks          = 8
                          + storageAccountType = "Premium_LRS"
                        }
                    }
                  + esSettings                       = {
                      + clusterName                 = "[parameters('esClusterName')]"
                      + heapSize                    = "[parameters('esHeapSize')]"
                      + httpCaCertBlob              = "[parameters('esHttpCaCertBlob')]"
                      + httpCaCertPassword          = "[parameters('esHttpCaCertPassword')]"
                      + httpCertBlob                = "[parameters('esHttpCertBlob')]"
                      + httpCertPassword            = "[parameters('esHttpCertPassword')]"
                      + installAdditionalPlugins    = "[parameters('esAdditionalPlugins')]"
                      + installPlugins              = "[parameters('xpackPlugins')]"
                      + samlMetadataUri             = "[parameters('samlMetadataUri')]"
                      + samlServiceProviderUri      = "[parameters('samlServiceProviderUri')]"
                      + securityAdminPwd            = "[parameters('securityAdminPassword')]"
                      + securityApmPwd              = "[parameters('securityApmPassword')]"
                      + securityBeatsPwd            = "[parameters('securityBeatsPassword')]"
                      + securityBootstrapPwd        = "[if(not(empty(parameters('securityBootstrapPassword'))),parameters('securityBootstrapPassword'),uniqueString(resourceGroup().id, deployment().name, parameters('securityAdminPassword')))]"
                      + securityKibanaPwd           = "[parameters('securityKibanaPassword')]"
                      + securityLogstashPwd         = "[parameters('securityLogstashPassword')]"
                      + securityRemoteMonitoringPwd = "[parameters('securityRemoteMonitoringPassword')]"
                      + transportCaCertBlob         = "[parameters('esTransportCaCertBlob')]"
                      + transportCaCertPassword     = "[parameters('esTransportCaCertPassword')]"
                      + transportCertPassword       = "[parameters('esTransportCertPassword')]"
                      + version                     = "[parameters('esVersion')]"
                      + yamlConfiguration           = "[parameters('esAdditionalYaml')]"
                    }
                  + esVersionMajor                   = "[int(split(parameters('esVersion'), '.')[0])]"
                  + esVersionMinor                   = "[int(split(parameters('esVersion'), '.')[1])]"
                  + kibanaHttps                      = "[if(and(greater(length(parameters('kibanaKeyBlob')), 0), greater(length(parameters('kibanaCertBlob')), 0)), 'Yes', 'No')]"
                  + kibanaIpTemplateUrl              = "[uri(parameters('_artifactsLocation'), concat(variables('kibanaIpTemplates')[variables('topologySettings').kibana], parameters('_artifactsLocationSasToken')))]"
                  + kibanaIpTemplates                = {
                      + No  = "empty/empty-kibana-ip-resources.json"
                      + Yes = "empty/empty-kibana-ip-resources.json"
                    }
                  + lbBackEndPoolsAdded              = {
                      + backendPools = "[variables('backendPoolConfigurations')[parameters('loadBalancerType')]]"
                    }
                  + lbBackendPoolsRemoved            = {
                      + backendPools = []
                    }
                  + loadBalancerOptions              = {
                      + external = "external-lb-resources"
                      + gateway  = "[concat(toLower(parameters('appGatewayTier')),'-application-gateway-resources')]"
                      + internal = "internal-lb-resources"
                    }
                  + loadBalancerTemplateUrl          = "[uri(parameters('_artifactsLocation'), concat('loadbalancers/', variables('loadBalancerOptions')[parameters('loadBalancerType')],'.json', parameters('_artifactsLocationSasToken')))]"
                  + location                         = "[parameters('location')]"
                  + networkResourceGroupMap          = {
                      + existing = "[parameters('vNetExistingResourceGroup')]"
                      + new      = "[resourceGroup().name]"
                    }
                  + networkSettings                  = {
                      + addressPrefix            = "[parameters('vNetNewAddressPrefix')]"
                      + applicationGatewaySubnet = {
                          + addressPrefix = "[parameters('vNetNewAppGatewaySubnetAddressPrefix')]"
                          + name          = "[parameters('vNetAppGatewaySubnetName')]"
                        }
                      + externalSku              = "[parameters('loadBalancerExternalSku')]"
                      + https                    = "[if(and(or(greater(length(parameters('esHttpCertBlob')), 0), greater(length(parameters('esHttpCaCertBlob')), 0)), or(equals(parameters('xpackPlugins'), 'Yes'), and(greaterOrEquals(variables('esVersionMajor'), 7), greaterOrEquals(variables('esVersionMinor'), 1)), and(equals(variables('esVersionMajor'), 6), greaterOrEquals(variables('esVersionMinor'), 8)))), 'Yes', 'No')]"
                      + internalSku              = "[parameters('loadBalancerInternalSku')]"
                      + location                 = "[variables('location')]"
                      + name                     = "[parameters('vNetName')]"
                      + namespacePrefix          = "[parameters('vmHostNamePrefix')]"
                      + resourceGroup            = "[variables('networkResourceGroupMap')[parameters('vNetNewOrExisting')]]"
                      + subnet                   = {
                          + addressPrefix  = "[parameters('vNetNewClusterSubnetAddressPrefix')]"
                          + loadbalancerIp = "[variables('vNetLoadBalancerIp')]"
                          + name           = "[parameters('vNetClusterSubnetName')]"
                        }
                    }
                  + networkTemplateUrl               = "[uri(parameters('_artifactsLocation'), concat('networks/virtual-network-resources.json', parameters('_artifactsLocationSasToken')))]"
                  + newSubNetFirstAvailableAddress   = "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 4)))]"
                  + newSubNetReservedStartAddresses  = [
                      + "[variables('newSubNetStartAddress')]",
                      + "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 1)))]",
                      + "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 2)))]",
                      + "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 3)))]",
                    ]
                  + newSubNetStartAddress            = "[if(equals('new', parameters('vNetNewOrExisting')), first(split(parameters('vNetNewClusterSubnetAddressPrefix'), '/')), '')]"
                  + newSubNetStartAddressFirstOctets = "[if(equals('new', parameters('vNetNewOrExisting')), substring(variables('newSubNetStartAddress'), 0, lastIndexOf(variables('newSubNetStartAddress'), '.')), '')]"
                  + newSubNetStartAddressLastOctet   = "[if(equals('new', parameters('vNetNewOrExisting')), int(last(split(variables('newSubNetStartAddress'), '.'))), 0)]"
                  + osSettingsTemplateUrl            = "[uri(parameters('_artifactsLocation'), concat('settings/ubuntuSettings.json', parameters('_artifactsLocationSasToken')))]"
                  + resolvedDataDiskCount            = "[min(variables('dataDiskOptions'))]"
                  + resolvedStorageAccountType       = "[variables('storageAccountOverrides')[parameters('storageAccountType')]]"
                  + sharedTemplateUrl                = "[uri(parameters('_artifactsLocation'), concat('partials/shared-resources.json', parameters('_artifactsLocationSasToken')))]"
                  + storageAccountOverrides          = {
                      + Default  = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].storageAccountType]"
                      + Standard = "Standard_LRS"
                    }
                  + tmpVmSizeDataDisks               = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].dataDisks]"
                  + topologySettings                 = {
                      + dataLoadBalancerBackEndPools      = "[variables('dataLoadBalancerOptions')[variables('clientResourceIndex')].backendPools]"
                      + dataNodeStorageSettings           = {
                          + accountType = "[variables('resolvedStorageAccountType')]"
                          + dataDisks   = "[variables('resolvedDataDiskCount')]"
                          + diskSize    = "[variables('dataDiskSizes')[parameters('vmDataDiskSize')]]"
                        }
                      + dataNodesAreMasterEligible        = "[parameters('dataNodesAreMasterEligible')]"
                      + jumpbox                           = "[parameters('jumpbox')]"
                      + kibana                            = "[parameters('kibana')]"
                      + kibanaCertBlob                    = "[parameters('kibanaCertBlob')]"
                      + kibanaHttps                       = "[variables('kibanaHttps')]"
                      + kibanaKeyBlob                     = "[parameters('kibanaKeyBlob')]"
                      + kibanaKeyPassphrase               = "[parameters('kibanaKeyPassphrase')]"
                      + kibanaYaml                        = "[parameters('kibanaAdditionalYaml')]"
                      + loadBalancerBackEndPools          = "[variables('lbBackEndPoolsAdded').backendPools]"
                      + logstash                          = "[parameters('logstash')]"
                      + logstashConf                      = "[parameters('logstashConf')]"
                      + logstashHeapSize                  = "[parameters('logstashHeapSize')]"
                      + logstashKeystorePwd               = "[if(not(empty(parameters('logstashKeystorePassword'))),parameters('logstashKeystorePassword'),uniqueString(resourceGroup().id, deployment().name, parameters('securityLogstashPassword')))]"
                      + logstashPlugins                   = "[parameters('logstashAdditionalPlugins')]"
                      + logstashYaml                      = "[parameters('logstashAdditionalYaml')]"
                      + vNetLoadBalancerIp                = "[variables('vNetLoadBalancerIp')]"
                      + vmClientNodeAcceleratedNetworking = "[parameters('vmClientNodeAcceleratedNetworking')]"
                      + vmClientNodeCount                 = "[parameters('vmClientNodeCount')]"
                      + vmDataNodeAcceleratedNetworking   = "[parameters('vmDataNodeAcceleratedNetworking')]"
                      + vmDataNodeCount                   = "[parameters('vmDataNodeCount')]"
                      + vmDataNodeStorageAccountType      = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].storageAccountType]"
                      + vmHostNamePrefix                  = "[parameters('vmHostNamePrefix')]"
                      + vmKibanaAcceleratedNetworking     = "[parameters('vmKibanaAcceleratedNetworking')]"
                      + vmLogstashAcceleratedNetworking   = "[parameters('vmLogstashAcceleratedNetworking')]"
                      + vmLogstashCount                   = "[parameters('vmLogstashCount')]"
                      + vmMasterNodeAcceleratedNetworking = "[parameters('vmMasterNodeAcceleratedNetworking')]"
                      + vmSizeClientNodes                 = "[parameters('vmSizeClientNodes')]"
                      + vmSizeDataNodes                   = "[parameters('vmSizeDataNodes')]"
                      + vmSizeKibana                      = "[parameters('vmSizeKibana')]"
                      + vmSizeLogstash                    = "[parameters('vmSizeLogstash')]"
                      + vmSizeMasterNodes                 = "[parameters('vmSizeMasterNodes')]"
                    }
                  + vNetLoadBalancerIp               = "[if(equals('existing', parameters('vNetNewOrExisting')), parameters('vNetLoadBalancerIp'), if(contains(variables('newSubNetReservedStartAddresses'), parameters('vNetLoadBalancerIp')), variables('newSubNetFirstAvailableAddress'), parameters('vNetLoadBalancerIp')))]"
                }
            }
        )
    }

  # module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd"
        name                     = "es-ccd"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.elastic2[0].module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd-17635"
        name                     = "es-ccd-17635"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 10 to add, 9 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.elastic2[0].azurerm_resource_group.elastic-resourcegroup has been deleted
  - resource "azurerm_resource_group" "elastic-resourcegroup" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-17635-elastic-search-aat"
      - location   = "uksouth" -> null
      - name       = "ccd-17635-elastic-search-aat" -> null
        tags       = {
            "application"         = "core-case-data"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd-community"
            "environment"         = "staging"
            "lastUpdated"         = "2024-05-17T14:18:38Z"
            "managedBy"           = "CCD"
        }
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":76,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->